app/views/messages/new.html.erb

<% @currentuser = User.find_by_id(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1