app/views/messages/show.html.erb

                    <td><%= message.sender_email %><br></td>
                    <% @sender = User.where("email = ?", message.sender_email) %>
---
SELECT "users".* FROM "users" WHERE (email = 'ins@class.com')