app/views/messages/showreply.html.erb

<% @currentuser = User.find_by_id(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1