ClassPortal/app/views/admin/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<h>Admin Homepage</h>
<% @user = User.find(session[:id])%>