test_portal/ClassPortal/app/views/student/index.html.erb

<h>Student Homepage</h>
<% @user = User.find(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]