app/views/admins/home.html.erb

<% @user = User.find(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]