app/views/admins/showadmins.html.erb

<% @currentuser = User.find(session[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]