app/views/admins/studentrequests.html.erb

<% @student_courses = StudentCourse.all %>
---
SELECT "student_courses".* FROM "student_courses"

        <%if student_course.has_requested %>
          <%	 @user = User.find_by_email(student_course.email) %>
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'stu@class.com' LIMIT 1