ClassPortal/app/views/student_courses/edit.html.erb


<% @user = User.find(session[:id])%>
<% @student_course = StudentCourse.find(params[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = ? LIMIT 1  [["id", "1"]]