ClassPortal/app/views/student_courses/index.html.erb


<% @user = User.find(session[:id]) %>
<!% @student_courses = StudentCourse.all %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "student_courses".* FROM "student_courses"