app/views/students/showsearchresults.erb

        <i>Back</i><%end%>
    <%@courses = Course.all %>
---
SELECT "courses".* FROM "courses"