app/views/students/viewcourses.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."email" = 'stu@class.com'
---
<%@student = User.find_by_id(session[:id])	  %>
<%@student_courses = StudentCourse.find_all_by_email(@student.email) %>

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
---
      <% @student_courses.each do |student_course| %>
          <% @course = Course.find_by_course_id(student_course.course_id) %>