ClassPortal/app/views/courses/edit.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---

<% @course = Course.find(params[:id])%>
<% @user = User.find(session[:id])%>