ClassPortal/app/views/courses/index.html.erb

SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."email" = 'ins@class.com'
---
<% elsif params[:instructor] and !params[:enrollment] %>
    <%@instructor_courses = InstructorCourse.find_all_by_email(params[:instructor]) %>

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'oodd' LIMIT 1
---
          <tr>
            <% @course = Course.find_by_course_id(instructor_course.course_id) %>

SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."course_id" = 'oodd'
---
            <% @course = Course.find_by_course_id(instructor_course.course_id) %>
            <% @student_course = StudentCourse.find_all_by_course_id(instructor_course.course_id) %>