app/views/instructor_courses/edit.html.erb

SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."id" = 1 LIMIT 1
---
    <h1>Edit Instructors Assigned To Courses</h1>
<% @instructor_course = InstructorCourse.find_by_id(params[:id]) %>