app/views/instructor_courses/index.html.erb

  <% @instructor_courses.each do |instructor_course| %>
  <% @course = Course.find_by_course_id(instructor_course.course_id) %>
      <tr>
        <% @user = User.find_by_email(instructor_course.email)%>
---
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'oodd' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'ins@class.com' LIMIT 1