app/views/instructor_courses/insthistory.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."email" = 'ins@class.com'
---
<%@inst = User.find_by_id(params[:id])	  %>
<%@inst_courses = InstructorCourse.find_all_by_email(@inst.email) %>

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
---
          <% @inst_courses.each do |inst_course| %>
              <% @course = Course.find_by_course_id(inst_course.course_id) %>