ClassPortal/app/views/instructor_courses/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."id" = ? LIMIT 1  [["id", "2"]]
---

<% @user = User.find(session[:id])%>
<% @instructor_course = InstructorCourse.find(params[:id]) %>