ClassPortal/app/views/instructor_courses/index.html.erb

<h1>Listing instructor_courses</h1>
<% @user = User.find(session[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]