app/views/instructors/home.html.erb

<% @user = User.find_by_id(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1