app/views/instructors/insstudents.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."email" = 'ins@class.com'
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
SELECT "student_courses".* FROM "student_courses"
---
<%@inst = User.find_by_id(session[:id])	  %>
<%@courses = InstructorCourse.find_all_by_email(@inst.email) %>
<%@students = StudentCourse.all  %>

SELECT "users".* FROM "users" WHERE "users"."email" = 'stu@class.com' LIMIT 1
---
            <% if student_course.course_id == course.course_id and student_course.is_curr_enrolled and @active.is_active%>
             <%	 @user = User.find_by_email(student_course.email) %>