app/views/instructors/studentsrequest.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."email" = 'ins@class.com'
SELECT "student_courses".* FROM "student_courses"
---
<%@inst = User.find_by_id(session[:id])	  %>
<%@courses = InstructorCourse.find_all_by_email(@inst.email) %>
<% @student_courses = StudentCourse.all %>