app/views/instructors/viewinscourses.html.erb

<%@inst = User.find_by_id(session[:id])	  %>
<%@instructor_courses = InstructorCourse.find_all_by_email(@inst.email) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."email" = 'ins@class.com'

    <% @instructor_courses.each do |instructor_course| %>
        <% @course = Course.find_by_course_id(instructor_course.course_id) %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1