app/views/users/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
---

  <% @user = User.find_by_id(params[:id])%>