app/views/users/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
<% @currentuser= User.find_by_id(session[:id]) %>