app/views/users/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
<% @user = User.find_by_id(session[:id])%>