app/views/users/show.html.erb

      <tbody>
      <% @user=User.find_by_id(params[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1