ClassPortal/app/views/users/edit.html.erb


<% @user_1 = User.find(params[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]