ClassPortal/app/views/users/show.html.erb

  <tbody>
  <% @user=User.find(params[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]