test_portal/ClassPortal/app/views/admin/index.html.erb

<h>Admin Homepage</h>
<% @user = User.find(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]