app/views/student_courses/edit.html.erb


<% @user = User.find(session[:id])%>
<% @student_course = StudentCourse.find_by_id(params[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = 1 LIMIT 1