app/views/student_courses/index.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'stu@class.com' LIMIT 1
---
    <% @student_courses.each do |student_course| %>
    <% @course = Course.find_by_course_id(student_course.course_id) %>
        <tr>
          <%	@user = User.find_by_email(student_course.email)  %>