app/views/student_courses/studenthistory.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."email" = 'stu@class.com'
---
<%@stu = User.find_by_id(params[:id])	  %>
<%@stu_courses = StudentCourse.find_all_by_email(@stu.email) %>

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
---
      <% @stu_courses.each do |student_course| %>
          <% @course = Course.find_by_course_id(student_course.course_id) %>