app/views/student_courses/studentcourses.html.erb

<%@course = Course.find_by_id(params[:id])	  %>
<%@student_courses = StudentCourse.all  %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 3 LIMIT 1
SELECT "student_courses".* FROM "student_courses"