ClassPortal/app/views/instructor/index.html.erb

<h>Instructor Homepage</h>
<% @user = User.find(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]