ClassPortal/app/views/layouts/_top.html.erb

      <% if session[:id] %>
          <% @user = User.find(session[:id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]