ClassPortal/app/controllers/admin_controller.rb

  def index
    @user = User.find(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @users = User.all
    @courses = Course.all
    @student_courses = StudentCourse.all
---
SELECT "users".* FROM "users"
SELECT "courses".* FROM "courses"
SELECT "student_courses".* FROM "student_courses"