ClassPortal/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'oodd' LIMIT 1
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("course_id", "created_at", "description", "email", "end_date", "is_active", "materials", "start_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)
    if @course.save

UPDATE "courses" SET "course_id" = ?, "updated_at" = ? WHERE "courses"."id" = 1  [["course_id", "521"], ["updated_at", Wed, 17 Feb 2016 01:03:50 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
---
  def destroy
    @course.destroy