ClassPortal/app/controllers/instructor_courses_controller.rb

SELECT "instructor_courses".* FROM "instructor_courses"
---
  def index
    @instructor_courses = InstructorCourse.all

INSERT INTO "instructor_courses" ("course_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", "oodd"], ["created_at", Wed, 17 Feb 2016 06:40:55 UTC +00:00], ["email", "oodd"], ["updated_at", Wed, 17 Feb 2016 06:40:55 UTC +00:00]]
---
  def create
    @instructor_course = InstructorCourse.new(instructor_course_params)

    respond_to do |format|
      if @instructor_course.save

UPDATE "instructor_courses" SET "course_id" = ?, "updated_at" = ? WHERE "instructor_courses"."id" = 5  [["course_id", "oods"], ["updated_at", Fri, 19 Feb 2016 02:00:34 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @instructor_course.update(instructor_course_params)

DELETE FROM "instructor_courses" WHERE "instructor_courses"."id" = ?  [["id", 2]]
---
  def destroy
    @instructor_course.destroy

SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_instructor_course
      @instructor_course = InstructorCourse.find(params[:id])