ClassPortal/app/controllers/student_courses_controller.rb

  def index
    @student_courses = StudentCourse.all
---
SELECT "student_courses".* FROM "student_courses"

  def create
    @student_course = StudentCourse.new(student_course_params)
    #@course = Course.where("course_id", params[:course_id])
    #@course = Course.find_by(course_id: params[:course_id])
    #@user = User.where("email", params[:email])
    #if Course.find_by(course_id: params[:course_id])

    #end
    #if params[:course_id] == @course.course_id and @student_course.email == @course.email
      if @student_course.save
---
INSERT INTO "student_courses" ("course_id", "email", "grade", "has_requested", "is_curr_enrolled", "is_denied") VALUES (?, ?, ?, ?, ?, ?)  [["course_id", "oodd"], ["email", "stu"], ["grade", "A"], ["has_requested", false], ["is_curr_enrolled", true], ["is_denied", false]]

  def update
    respond_to do |format|
      if @student_course.update(student_course_params)
---
UPDATE "student_courses" SET "has_requested" = ? WHERE "student_courses"."id" = 2  [["has_requested", true]]

  def destroy
    @student_course.destroy
---
DELETE FROM "student_courses" WHERE "student_courses"."id" = ?  [["id", 1]]

    def set_student_course
      @student_course = StudentCourse.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE (course_id) ORDER BY "courses"."id" ASC LIMIT 1
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = ? LIMIT 1  [["id", "2"]]