ClassPortal/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "is_admin", "is_instructor", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    @admin = User.find(session[:id])
    @admin1 = User.find(params[:id])
    if @admin==@admin1
      flash[:notice]="Error: Cannot Delete Yourself!!"
      redirect_to(:controller => 'admin', :action => 'show_profiles')
    else
      @admin1.destroy