test_portal/ClassPortal/app/views/courses/show.html.erb

  <tbody>
  <% @course=Course.find(params[:id]) %>
  <% @user1=User.find(session[:id]) %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]