app/views/courses/edit.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---

    <% @course = Course.find_by_id(params[:id])%>
    <% @user = User.find_by_id(session[:id])%>