app/views/courses/index.html.erb

<% @user = User.find(session[:id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]