ClassPortal/app/views/student/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
<h>Student Homepage</h>
<% @user = User.find(session[:id])%>