app/controllers/admins_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def home
   @user = User.find_by_id(session[:id])

SELECT "users".* FROM "users"
---
  def showinstructors
    @users = User.all

SELECT "users".* FROM "users"
---
  def showstudents
    @users = User.all

SELECT "users".* FROM "users" WHERE (is_instructor = 't')
---
  def showadmins
    @users = User.where("is_admin = ?", true)

SELECT "course_inactive_requests".* FROM "course_inactive_requests"
---
  def inactivation_req
    @course_in_reqs = CourseInactiveRequest.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_user
    @user = User.find_by_id(params[:id])