app/controllers/courses_controller.rb

  def show
    @course = Course.find_by_id(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1

  def new
    @course = Course.new
    @inst = User.where("is_instructor = ?", true)
---
SELECT "users".* FROM "users" WHERE (is_instructor = 't')

  def edit
    @course = Course.find_by_id(params[:id])
    @inst = User.where("is_instructor = ?", true)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE (is_instructor = 't')

  def create
    @course = Course.new(course_params)
    if @course.save
      flash[:notice]="Course was successfully created."
      @instructor_course = InstructorCourse.create( course_id: course_params[:course_id], email: course_params[:email])
---
INSERT INTO "courses" ("course_id", "created_at", "description", "email", "end_date", "is_active", "materials", "start_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "instructor_courses" ("course_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", "ODD"], ["created_at", Fri, 19 Feb 2016 08:46:23 UTC +00:00], ["email", "ins@class.com"], ["updated_at", Fri, 19 Feb 2016 08:46:23 UTC +00:00]]

  def update
    @course= Course.find_by_id(params[:id])
    if @course.update(course_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
UPDATE "courses" SET "is_active" = ?, "updated_at" = ? WHERE "courses"."id" = 3  [["is_active", true], ["updated_at", Sat, 20 Feb 2016 00:26:58 UTC +00:00]]

  def destroy
    @course= Course.find_by_id(params[:id])
    if !@course.nil?
      @inst_course = InstructorCourse.find_by_course_id(@course.course_id)
      if !@inst_course.nil?
        @inst_course.destroy
      end
      @student_course = StudentCourse.find_by_course_id(@course.course_id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."course_id" = 'aaa' LIMIT 1
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
DELETE FROM "instructor_courses" WHERE "instructor_courses"."id" = ?  [["id", 5]]
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."course_id" = 'aaa' LIMIT 1

  def req_inactivation
    @course_in_req = CourseInactiveRequest.new
    @course_in_req.course_id = params[:course_id]
    if @course_in_req.save
---
INSERT INTO "course_inactive_requests" ("course_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["course_id", "oodd"], ["created_at", Fri, 26 Feb 2016 01:57:01 UTC +00:00], ["updated_at", Fri, 26 Feb 2016 01:57:01 UTC +00:00]]

  def make_inactive
    @course = Course.find_by_course_id(params[:course_id])
    if @course.update_attributes(:is_active => false)
      @course_in_req = CourseInactiveRequest.find_by_course_id(params[:course_id])
      if @course_in_req.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'oodd' LIMIT 1
UPDATE "courses" SET "is_active" = ?, "updated_at" = ? WHERE "courses"."id" = 1  [["is_active", false], ["updated_at", Fri, 26 Feb 2016 02:36:20 UTC +00:00]]
SELECT "course_inactive_requests".* FROM "course_inactive_requests" WHERE "course_inactive_requests"."course_id" = 'oodd' LIMIT 1
DELETE FROM "course_inactive_requests" WHERE "course_inactive_requests"."id" = ?  [["id", 4]]

  def notify
    @notification = Notification.new
    @notification.course_id = params[:course_id]
    @currentuser = User.find(session[:id])
    @notification.email = @currentuser.email
    if @notification.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "notifications" ("course_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", "oodd"], ["created_at", Sat, 27 Feb 2016 02:38:13 UTC +00:00], ["email", "stu@class.com"], ["updated_at", Sat, 27 Feb 2016 02:38:13 UTC +00:00]]