app/controllers/home_controller.rb

  def logintry
    if params[:email].present? && params[:password].present?
        if (user=User.where(:email => params[:email]).first)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@admin.com' ORDER BY "users"."id" ASC LIMIT 1