app/controllers/instructor_courses_controller.rb

SELECT 1 AS one FROM "courses" WHERE "courses"."email" = 'ins@class.com' LIMIT 1
---
  def destroy
    @instructor_course = InstructorCourse.find(params[:id])
    if(Course.exists?(:email => @instructor_course.email))