app/controllers/instructors_controller.rb

  def set_user
    @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]