app/controllers/instructor_courses_controller.rb

  def index
    @instructor_courses = InstructorCourse.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'oodd' LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses"

  def new
    @instructor_course = InstructorCourse.new
    @inst = User.where("is_instructor = ?", true)
    @courses = Course.where("is_active = ?", true)
---
SELECT "users".* FROM "users" WHERE (is_instructor = 't')
SELECT "courses".* FROM "courses" WHERE (is_active = 't')

  def edit
    @instructor_course = InstructorCourse.find_by_id(params[:id])
---
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."id" = 1 LIMIT 1

  def update
    @instructor_course = InstructorCourse.find_by_id(params[:id])
      if @instructor_course.update(instructor_course_params)
---
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."id" = 1 LIMIT 1
UPDATE "instructor_courses" SET "email" = ?, "updated_at" = ? WHERE "instructor_courses"."id" = 1  [["email", "inst@class.com"], ["updated_at", Fri, 19 Feb 2016 09:09:35 UTC +00:00]]

  def destroy
    @instructor_course = InstructorCourse.find(params[:id])
    @currcourse = Course.find_by_email(@instructor_course.email)
---
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "courses".* FROM "courses" WHERE "courses"."email" = 'ins@class.com' LIMIT 1

    def set_instructor_course
      @instructor_course = InstructorCourse.find_by_id(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1