app/controllers/messages_controller.rb

  def new
    @currentuser = User.find(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1

  def create
    @message = Message.new(message_params)
    @message.sender_email = User.find(session[:id]).email
    if @message.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "messages" ("created_at", "msg_text", "reciever_email", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Feb 2016 00:08:54 UTC +00:00], ["msg_text", "hi"], ["reciever_email", "ins@class.com"], ["updated_at", Wed, 24 Feb 2016 00:08:54 UTC +00:00]]

  def show
    @currentuser = User.find(session[:id])
    @to_messages = Message.where("sender_email = ?", @currentuser.email)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
SELECT "messages".* FROM "messages" WHERE (reciever_email = 'stu@class.com')

  def reply
    @currentuser = User.find(session[:id])
    @reciever_user = User.find(params[:id])
    @message = Message.new(message_params)
    @message.sender_email = @currentuser.email
    @message.reciever_email = @reciever_user.email

    if @message.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "messages" ("created_at", "reciever_email", "sender_email", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Feb 2016 02:17:43 UTC +00:00], ["reciever_email", "stu@class.com"], ["sender_email", "stu1@class.com"], ["updated_at", Wed, 24 Feb 2016 02:17:43 UTC +00:00]]