app/controllers/student_courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
SELECT "student_courses".* FROM "student_courses"
---
  def index
    @student_courses = StudentCourse.all

SELECT "users".* FROM "users" WHERE (is_admin = 'f' AND is_instructor = 'f')
SELECT "courses".* FROM "courses" WHERE (is_active = 't')
---
  def new
    @student_course = StudentCourse.new
    @students = User.where("is_admin = ? AND is_instructor = ?", false,false)
    @courses = Course.where("is_active = ?", true)

SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = 1 LIMIT 1
---
  def edit
    @student_course = StudentCourse.find_by_id(params[:id])

INSERT INTO "student_courses" ("course_id", "created_at", "email", "has_requested", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course_id", "517"], ["created_at", Fri, 19 Feb 2016 19:36:36 UTC +00:00], ["email", "stu@class.com"], ["has_requested", true], ["updated_at", Fri, 19 Feb 2016 19:36:36 UTC +00:00]]
---
  def create
    @student_course = StudentCourse.new(student_course_params)
    if params[:student]
      @student_course.has_requested = true
      @student_course.email = params[:email]
    else
      @student_course.is_curr_enrolled = true
      @student_course.has_requested = false
      @student_course.is_denied = false
    end
    if @student_course.save

SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
UPDATE "student_courses" SET "is_curr_enrolled" = ?, "has_requested" = ?, "is_denied" = ?, "grade" = ?, "updated_at" = ? WHERE "student_courses"."id" = 3  [["is_curr_enrolled", false], ["has_requested", false], ["is_denied", true], ["grade", ""], ["updated_at", Sat, 20 Feb 2016 01:44:59 UTC +00:00]]
---
  def update
    @student_course = StudentCourse.find_by_id(params[:id])
    @currentuser= User.find_by_id(session[:id])
    if params[:drop]
      if @student_course.update_attributes(:is_curr_enrolled => false , :has_requested => false, :is_denied => true )

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = 'ODD' LIMIT 1
---
    def set_student_course
      @student_course = StudentCourse.find_by_id(params[:id])