app/controllers/students_controller.rb

  def showsearchresults
      @temp_courses = Course.all
---
SELECT "courses".* FROM "courses"

  def showmyrequests
    @user = User.find(session[:id])
    @student_courses = StudentCourse.where("email = ? AND (has_requested = ? AND is_denied = ?)", @user.email, true, false)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
SELECT "student_courses".* FROM "student_courses" WHERE (email = 'stu@class.com' AND (has_requested = 't' OR is_denied = 't'))

  def enrollmentrequest
    @user = User.find(session[:id])
    @student_course = StudentCourse.new
    @student_course.email = @user.email
    @student_course.course_id = params[:course_id]
    @student_course.has_requested = true
    if @student_course.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "student_courses" ("course_id", "created_at", "email", "has_requested", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course_id", "517"], ["created_at", Sat, 20 Feb 2016 22:29:31 UTC +00:00], ["email", "stu@class.com"], ["has_requested", true], ["updated_at", Sat, 20 Feb 2016 22:29:31 UTC +00:00]]

  def set_user
    @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]