app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @user = User.find_by_id(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @user = User.find_by_id(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 20 Feb 2016 01:57:27 UTC +00:00], ["email", "bruce@wayne.com"], ["name", "Batman"], ["password", "batman"], ["updated_at", Sat, 20 Feb 2016 01:57:27 UTC +00:00]]
---
  def create
    @user = User.new(user_params)
    @currentuser = User.find_by_id(session[:id])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "is_instructor" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["is_instructor", false], ["updated_at", Thu, 25 Feb 2016 21:50:33 UTC +00:00]]
---
  def update
    @user= User.find_by_id(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT "courses".* FROM "courses" WHERE "courses"."email" = 'ins@class.com' LIMIT 1
SELECT "instructor_courses".* FROM "instructor_courses" WHERE "instructor_courses"."email" = 'ins@class.com' LIMIT 1
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."email" = 'bruce@wayne.com' LIMIT 1
DELETE FROM "student_courses" WHERE "student_courses"."id" = ?  [["id", 2]]
---
  def destroy
    @currentuser= User.find_by_id(session[:id])
    @user = User.find_by_id(params[:id])
    if @currentuser==@user
      flash[:notice]="Error: Cannot Delete Yourself!!"
      redirect_to(:controller => 'users', :action => 'index')
    elsif @user.email == 'master@master.com'
      flash[:notice]="Error: Cannot Delete Master Yoda!!"
      redirect_to(:controller => 'users', :action => 'index')
    elsif @user.is_admin
      @user.destroy
      redirect_to(:controller => 'users', :action => 'index')
    elsif @user.is_instructor
        @course = Course.find_by_email(@user.email)
        @instructorcourse = InstructorCourse.find_by_email(@user.email)
        if !@course.nil?
          flash[:notice]="Error: This Instructor is a primary instructor for a course, first edit course details!!"
          redirect_to(:controller => 'users', :action => 'index')
        elsif !@instructorcourse.nil?
          @instructorcourse.destroy
          @user.destroy
          redirect_to(:controller => 'users', :action => 'index')
        end
    elsif !@user.is_instructor and !@user.is_admin
        @studentcourse = StudentCourse.find_by_email(@user.email)
        if !@studentcourse.nil
          @studentcourse.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_user
      @user = User.find_by_id(params[:id])