test_portal/ClassPortal/app/controllers/admin_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @user = User.find(session[:id])

SELECT "users".* FROM "users"
SELECT "courses".* FROM "courses"
---
  def show
    @users = User.all
    @courses = Course.all