test_portal/ClassPortal/app/controllers/courses_controller.rb

  def update
    @course= Course.find(params[:id])
    if @course.update(course_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "courses" SET "course_id" = ?, "updated_at" = ? WHERE "courses"."id" = 1  [["course_id", "521"], ["updated_at", Wed, 17 Feb 2016 01:03:50 UTC +00:00]]

  def destroy
    @course= Course.find(params[:id])
    @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]